##### This notebook begins the exploratory data analysis towards building a demand forecasting app using a hierarchical time series (HTS) forecasting method.

Our first task is to build a basic time series model for one item or category of items.

In [36]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

In [37]:
df1 = pd.read_csv('/Users/user/hts-forecast/volume/data/raw/sales_train_evaluation.csv')

In [38]:
df1.shape

(30490, 1947)

In [39]:
df1.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,1,2,1,1,0,0,0,0,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,0,2,0,0,0,2,3,0,1
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,0,4,0,1,3,0,2,6
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,2,1,0,0,2,1,0

In [40]:
df1.describe()

,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,d_9,d_10,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
count,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,...,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000,30490.000000
mean,1.070220,1.041292,0.780026,0.833454,0.627944,0.958052,0.918662,1.244080,1.073663,0.838701,...,1.445490,1.781174,1.965267,1.389374,1.271794,1.216661,1.212299,1.395605,1.689669,1.782158
std,5.126689,5.365468,3.667454,4.415141,3.379344,4.785947,5.059495,6.617729,5.917204,4.206199,...,3.656824,4.426550,4.706284,3.313292,3.126178,3.000348,2.955910,3.514318,4.089208,4.284356
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000,1.000000
75%,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,2.000000,2.000000,2.000000,2.000000,1.000000,1.000000,1.000000,1.000000,2.000000,2.000000
max,360.000000,436.000000,207.000000,323.000000,296.000000,314.000000,316.000000,370.000000,385.000000,353.000000,...,143.000000,156.000000,187.000000,98.000000,90.000000,77.000000,84.000000,110.000000,156.000000,117.000000

######Â Lets explore the state_id, store_id, cat_id and dept_id further:

In [41]:
df1.groupby('state_id')['state_id'].agg('count')

state_id
CA    12196
TX     9147
WI     9147
Name: state_id, dtype: int64

In [42]:
df1.groupby('store_id')['store_id'].agg('count')

store_id
CA_1    3049
CA_2    3049
CA_3    3049
CA_4    3049
TX_1    3049
TX_2    3049
TX_3    3049
WI_1    3049
WI_2    3049
WI_3    3049
Name: store_id, dtype: int64

In [43]:
df1.groupby('cat_id')['cat_id'].agg('count')

cat_id
FOODS        14370
HOBBIES       5650
HOUSEHOLD    10470
Name: cat_id, dtype: int64

In [44]:
df1.groupby('dept_id')['dept_id'].agg('count')

dept_id
FOODS_1        2160
FOODS_2        3980
FOODS_3        8230
HOBBIES_1      4160
HOBBIES_2      1490
HOUSEHOLD_1    5320
HOUSEHOLD_2    5150
Name: dept_id, dtype: int64

In [48]:
len(df1.item_id.unique())

3049

Lets start by only dealing with "Hobbies_1" items:

In [49]:
df2 = df1[df1.dept_id=='HOBBIES_1']
df2.shape

(4160, 1947)

In [50]:
df2.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,1,2,1,1,0,0,0,0,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,0,2,0,0,0,2,3,0,1
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,0,4,0,1,3,0,2,6
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,2,1,0,0,2,1,0

In [28]:
len(df2.item_id.unique())

416

We can use the store_id to represent both the store and the state. Also, we don't need dept_id or cat_id as they are the same for Hobbies_1. The item_id does the job of the id so id is also unnecessary.

In [81]:
df3 = df2.drop(['id','dept_id','cat_id','state_id'], axis='columns')
df3.head()

,item_id,store_id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,HOBBIES_1_001,CA_1,0,0,0,0,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,HOBBIES_1_002,CA_1,0,0,0,0,0,0,0,0,...,0,1,2,1,1,0,0,0,0,0
2,HOBBIES_1_003,CA_1,0,0,0,0,0,0,0,0,...,1,0,2,0,0,0,2,3,0,1
3,HOBBIES_1_004,CA_1,0,0,0,0,0,0,0,0,...,1,1,0,4,0,1,3,0,2,6
4,HOBBIES_1_005,CA_1,0,0,0,0,0,0,0,0,...,0,0,0,2,1,0,0,2,1,0

Now lets encode the item_id and store_id columns:

In [72]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df4 = df3.copy()
df4.item_id = le.fit_transform(df4.item_id)
df4.store_id = le.fit_transform(df4.store_id)
df4.head()

,item_id,store_id,d_1,d_2,d_3,d_4,d_5,d_6,d_7,d_8,...,d_1932,d_1933,d_1934,d_1935,d_1936,d_1937,d_1938,d_1939,d_1940,d_1941
0,0,0,0,0,0,0,0,0,0,0,...,2,4,0,0,0,0,3,3,0,1
1,1,0,0,0,0,0,0,0,0,0,...,0,1,2,1,1,0,0,0,0,0
2,2,0,0,0,0,0,0,0,0,0,...,1,0,2,0,0,0,2,3,0,1
3,3,0,0,0,0,0,0,0,0,0,...,1,1,0,4,0,1,3,0,2,6
4,4,0,0,0,0,0,0,0,0,0,...,0,0,0,2,1,0,0,2,1,0

In [70]:
df4.groupby('item_id')['item_id'].agg('count')

item_id
0      10
1      10
2      10
3      10
4      10
       ..
411    10
412    10
413    10
414    10
415    10
Name: item_id, Length: 416, dtype: int64

In [69]:
df4.groupby('store_id')['store_id'].agg('count')

store_id
0    416
1    416
2    416
3    416
4    416
5    416
6    416
7    416
8    416
9    416
Name: store_id, dtype: int64

In [83]:
df4.shape

(4160, 1943)

###### We need to categorize the date columns (d_1 to d_1941) to dates of the year so that we can predict the number of days based on actual dates of the year.

Lets look at the calender file

In [22]:
df_cal = pd.read_csv('/Users/user/hts-forecast/volume/data/raw/calendar.csv')
df_cal.head()

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
0,2011-01-29,11101,Saturday,1,1,2011,d_1,NaN,NaN,NaN,NaN,0,0,0
1,2011-01-30,11101,Sunday,2,1,2011,d_2,NaN,NaN,NaN,NaN,0,0,0
2,2011-01-31,11101,Monday,3,1,2011,d_3,NaN,NaN,NaN,NaN,0,0,0
3,2011-02-01,11101,Tuesday,4,2,2011,d_4,NaN,NaN,NaN,NaN,1,1,0
4,2011-02-02,11101,Wednesday,5,2,2011,d_5,NaN,NaN,NaN,NaN,1,0,1

In [25]:
df_cal[df_cal.event_name_1=='NewYear']

,date,wm_yr_wk,weekday,wday,month,year,d,event_name_1,event_type_1,event_name_2,event_type_2,snap_CA,snap_TX,snap_WI
337,2012-01-01,11149,Sunday,2,1,2012,d_338,NewYear,National,NaN,NaN,1,1,0
703,2013-01-01,11249,Tuesday,4,1,2013,d_704,NewYear,National,NaN,NaN,1,1,0
1068,2014-01-01,11349,Wednesday,5,1,2014,d_1069,NewYear,National,NaN,NaN,1,1,0
1433,2015-01-01,11448,Thursday,6,1,2015,d_1434,NewYear,National,NaN,NaN,1,1,0
1798,2016-01-01,11548,Friday,7,1,2016,d_1799,NewYear,National,NaN,NaN,1,1,0

In the above dataframe, we see which 'd' columns represent the start of the new year. From Hobbies_1 dataframe, lets create new dataframes for each calendar year for 2012-2015:

In [114]:
df_2012 = df4.iloc[:,339:705]
df_2013 = df4.iloc[:,705:1070]
df_2014 = df4.iloc[:,1070:1435]
df_2015 = df4.iloc[:,1435:1800]

df_id = df4.iloc[:,0:2]

df_12 = pd.concat([df_id, df_2012], axis= 'columns', ignore_index = True)
df_12.rename(columns={0:'item_id', 1:'store_id'},inplace=True)
df_13 = pd.concat([df_id, df_2013], axis= 'columns', ignore_index = True)
df_13.rename(columns={0:'item_id', 1:'store_id'},inplace=True)
df_14 = pd.concat([df_id, df_2014], axis= 'columns', ignore_index = True)
df_14.rename(columns={0:'item_id', 1:'store_id'},inplace=True)
df_15 = pd.concat([df_id, df_2015], axis= 'columns', ignore_index = True)
df_15.rename(columns={0:'item_id', 1:'store_id'},inplace=True)

In [116]:
df_12.head()

,item_id,store_id,2,3,4,5,6,7,8,9,...,358,359,360,361,362,363,364,365,366,367
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,1,0,0,0,0,1,0,0,0,0,...,1,3,3,0,0,0,0,0,0,0
2,2,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,3,0,0,0,0,0,0,6,3,3,...,0,0,0,0,0,0,0,0,0,0
4,4,0,1,0,2,1,0,2,5,0,...,5,2,4,0,0,1,3,5,2,0

In [117]:
df_13.head()

,item_id,store_id,2,3,4,5,6,7,8,9,...,357,358,359,360,361,362,363,364,365,366
0,0,0,0,0,0,0,0,0,0,0,...,1,0,1,0,0,0,0,0,0,0
1,1,0,1,0,0,0,0,0,0,0,...,1,0,0,0,0,0,0,0,0,0
2,2,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,3,0,0,0,0,0,0,0,0,0,...,6,2,0,0,3,0,10,5,1,3
4,4,0,1,1,2,0,4,1,1,0,...,2,5,0,0,1,2,0,0,0,1

In [118]:
df_14.head()

,item_id,store_id,2,3,4,5,6,7,8,9,...,357,358,359,360,361,362,363,364,365,366
0,0,0,1,1,0,0,0,0,0,1,...,0,1,0,0,1,1,5,1,1,0
1,1,0,0,0,0,0,0,0,0,1,...,2,3,3,0,1,0,0,0,0,0
2,2,0,0,0,0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,0
3,3,0,2,4,4,2,0,1,4,1,...,1,3,0,0,2,10,2,1,0,0
4,4,0,1,0,0,0,1,0,0,0,...,3,2,2,0,0,1,0,3,0,0

In [119]:
df_15.head()

,item_id,store_id,2,3,4,5,6,7,8,9,...,357,358,359,360,361,362,363,364,365,366
0,0,0,0,0,0,0,0,0,0,2,...,0,3,0,0,0,1,0,2,2,1
1,1,0,0,0,0,0,0,0,0,0,...,0,3,5,0,0,1,0,0,0,0
2,2,0,0,1,0,0,0,0,0,0,...,1,2,3,0,1,2,1,3,0,1
3,3,0,2,4,3,3,0,2,2,3,...,1,0,0,0,3,4,0,0,1,5
4,4,0,3,0,1,1,1,0,0,0,...,2,3,4,0,0,1,0,0,1,0